/* The error message displayed when unable to generate a barcode. */
"%@ cannot encode '%@' at index %d" = "%1$@ cannot encode '%2$@' at index %3$d";

/* The error message displayed when unable to generate a barcode. */
"%@ does not support alpha-numeric characters" = "%@ does not support alpha-numeric characters";

/* The error message displayed when unable to generate a barcode. */
"%@ only supports 7 character ISSN strings, excluding the check digit" = "%@ only supports 7 character ISSN strings, excluding the check digit";

/* The error message displayed when unable to generate a barcode. */
"%@ requires at least three characters" = "%@ requires at least three characters";

/* The error message displayed when unable to generate a barcode. */
"%@ requires content strings with exactly 5 characters" = "%@ requires content strings with exactly 5 characters";

/* The error message displayed when unable to generate a barcode. */
"%@ requires content to be 12 digits" = "%@ requires content to be 12 digits";

/* The error message displayed when unable to generate a barcode. */
"%@ requires content to be 13 digits" = "%@ requires content to be 13 digits";

/* The error message displayed when unable to generate a barcode. */
"%@ requires content to be 8 digits" = "%@ requires content to be 8 digits";

/* The error message displayed when unable to generate a barcode. */
"%@ requires content to be of even length" = "%@ requires content to be of even length";

/* The error message displayed when unable to generate a barcode. */
"%@ requires first digit to be 0 or 1" = "%@ requires first digit to be 0 or 1";

/* The error message displayed when unable to generate a barcode. */
"%@ requires the first digit to be a 0, 1, 3, 4, 5 or 6" = "%@ requires the first digit to be a 0, 1, 3, 4, 5 or 6";

/* The error message displayed when unable to generate a barcode. */
"%@ supports content equal or greater than 0 and less than 100" = "%@ supports content equal or greater than 0 and less than 100";

/* The error message displayed when unable to generate a barcode. */
"%d is not a supported FIM type for %@" = "%1$d is not a supported FIM type for %2$@";

/* The error message displayed when unable to generate a barcode. */
"'%@' is not a supported FIM type for %@" = "'%1$@' is not a supported FIM type for %2$@";

/* The error message displayed when unable to generate a barcode. */
"Character at index %d '%@' cannot be encoded in %@" = "Character at index %1$d '%2$@' cannot be encoded in %3$@";

/* The error message displayed when unable to generate a barcode. */
"Character at index %d '%@' is an invalid start character for %@" = "Character at index %1$d '%2$@' is an invalid start character for %3$@";

/* The error message displayed when unable to generate a barcode. */
"Character at index %d '%@' is an invalid stop character for %@" = "Character at index %1$d '%2$@' is an invalid stop character for %3$@";

/* The error message displayed when unable to generate a barcode. */
"Characters '%@' and '%@' cannot be encoded in %@" = "Characters '%1$@' and '%2$@' cannot be encoded in %3$@";

/* The error message displayed when unable to generate a barcode. */
"Check digit '%@' is not correct for this ISBN10 string" = "Check digit '%@' is not correct for this ISBN10 string";

/* The error message displayed when unable to generate a barcode. */
"Check digit '%@' is not correct for this ISSN string" = "Check digit '%@' is not correct for this ISSN string";

/* The error message displayed when unable to generate a barcode. */
"Content contains characters that cannot be encoded by Code39" = "Content contains characters that cannot be encoded by Code39";

/* The error message displayed when unable to generate a barcode. */
"Contents cannot be encoded in %@, only integer values between 3 and 131070 are supported" = "Contents cannot be encoded in %@, only integer values between 3 and 131070 are supported";

/* The error message displayed when unable to generate a barcode. */
"Digit at index %d '%@' cannot be encoded in %@" = "Digit at index %1$d '%2$@' cannot be encoded in %3$@";

/* The error message displayed when unable to generate a barcode. */
"Invalid barcode provided. Check number does not match" = "Invalid barcode provided. Check number does not match";

/* The error message displayed when unable to generate a barcode. */
"String '%@' cannot be encoded in Code128. Character at index %d (%@) not supported" = "String '%1$@' cannot be encoded in Code128. Character at index %2$d (%3$@) not supported";

/* The error message displayed when unable to generate a barcode. */
"The check digit '%@' is not correct for this ISBN13 string" = "The check digit '%@' is not correct for this ISBN13 string";

/* The error message displayed when unable to generate a barcode. */
"The ISBN10 string does not have 10 characters" = "The ISBN10 string does not have 10 characters";

/* The error message displayed when unable to generate a barcode. */
"The ISBN13 string does not have 13 characters" = "The ISBN13 string does not have 13 characters";

/* The error message displayed when unable to generate a barcode. */
"The string is not a valid ISBN10 or ISBN13 string supported by %@" = "The string is not a valid ISBN10 or ISBN13 string supported by %@";

/* The error message displayed when unable to generate a barcode. */
"The string is not a valid ISBN10 string supported by %@" = "The string is not a valid ISBN10 string supported by %@";

/* The error message displayed when unable to generate a barcode. */
"The string is not a valid ISBN13 string supported by %@" = "The string is not a valid ISBN13 string supported by %@";

/* The error message displayed when unable to generate a barcode. */
"The string is not a valid ISSN string supported by %@" = "The string is not a valid ISSN string supported by %@";

/* The error message displayed when unable to generate a barcode. */
"Unable to encoded empty string in %@" = "Unable to encoded empty string in %@";

/* The error message displayed when unable to generate a barcode. */
"Variant one must be a numeric character" = "Variant one must be a numeric character";

/* The error message displayed when unable to generate a barcode. */
"Variant one must be identical to one numeric character" = "Variant one must be identical to one numeric character";

/* The error message displayed when unable to generate a barcode. */
"Variant two must be a numeric character" = "Variant two must be a numeric character";

/* The error message displayed when unable to generate a barcode. */
"Variant two must be identical to one alphanumeric character" = "Variant two must be identical to one alphanumeric character";

